package main.java.com.lab111.labwork4;

//5. Визначити специфікації класів, які подають графічні об'єкти у редакторі векторної графіки -
//примітиви (точка) та їх композиції (лінія). Примітиви мають цілочислові атрибути
//координат (в пікселях), а об'єкти-композиції — раціональні (в сантиметрах). Відповідно
//інтерфейс точки містить методи setХ(int) та setY(int), а метод малювання лінії може
//оперувати лише методами setX(double), setY(double) примітива (які відсутні в класі точки).
//Забезпечити можливість використання функціональності точки при малюванні лінії без
//зміни інтерфейсу точки та методу малювання лінії.
public class Main {
    public static void main(String[] args) {
        Point point1 = new PointPrimitive(10, 50);
        Point point2 = new PointPrimitive(-10, 100);
        GraphicObject line1 = new PointToLine(point1, point2);
        line1.draw();
    }
}
